Revit 2024 API
FormattedText.GetUnderlineStatus Method
Overload List
Name | Description
GetUnderlineStatus()
 Returns whether All, None or a Mixed of characters in the entire text are underlined.
GetUnderlineStatus(TextRange)
 Returns whether All, None or a Mixed set of characters in a given text range are underlined.
See Also
FormattedText Class
FormattedText Members
Autodesk.Revit.DB Namespace